iNavFlight/inav/lib/main/STM32H7/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xxxxx.h
#if !$H7_TINY_SHARK$
/*!< D1_AHB1PERIPH peripherals */

#define MDMA_BASE             (D1_AHB1PERIPH_BASE + 0x0000UL)
#define DMA2D_BASE            (D1_AHB1PERIPH_BASE + 0x1000UL)
#if $H7_JPEG$
#define JPGDEC_BASE           (D1_AHB1PERIPH_BASE + 0x3000UL)
#endif /* H7_JPEG */
#define FLASH_R_BASE          (D1_AHB1PERIPH_BASE + 0x2000UL)
#define FMC_R_BASE            (D1_AHB1PERIPH_BASE + 0x4000UL)
#if !$H7_LITTLE_SHARK$
#define QSPI_R_BASE           (D1_AHB1PERIPH_BASE + 0x5000UL)
#define DLYB_QSPI_BASE        (D1_AHB1PERIPH_BASE + 0x6000UL)
#else
#define OCTOSPI1_R_BASE       (D1_AHB1PERIPH_BASE + 0x5000UL)
#define DLYB_OCTOSPI1_BASE    (D1_AHB1PERIPH_BASE + 0x6000UL)
#endif /* !H7_LITTLE_SHARK */
#define SDMMC1_BASE           (D1_AHB1PERIPH_BASE + 0x7000UL)
#define DLYB_SDMMC1_BASE      (D1_AHB1PERIPH_BASE + 0x8000UL)
#define RAMECC1_BASE          (D1_AHB1PERIPH_BASE + 0x9000UL)
#if $H7_LITTLE_SHARK$
#define OCTOSPI2_R_BASE       (D1_AHB1PERIPH_BASE + 0xA000UL)
#define DLYB_OCTOSPI2_BASE    (D1_AHB1PERIPH_BASE + 0xB000UL)
#define OCTOSPIM_BASE         (D1_AHB1PERIPH_BASE + 0xB400UL)
#if $CRYP_HASH$

#define OTFDEC1_BASE          (D1_AHB1PERIPH_BASE + 0xB800UL)
#define OTFDEC1_REGION1_BASE  (OTFDEC1_BASE + 0x20UL)
#define OTFDEC1_REGION2_BASE  (OTFDEC1_BASE + 0x50UL)
#define OTFDEC1_REGION3_BASE  (OTFDEC1_BASE + 0x80UL)
#define OTFDEC1_REGION4_BASE  (OTFDEC1_BASE + 0xB0UL)
#define OTFDEC2_BASE          (D1_AHB1PERIPH_BASE + 0xBC00UL)
#define OTFDEC2_REGION1_BASE  (OTFDEC2_BASE + 0x20UL)
#define OTFDEC2_REGION2_BASE  (OTFDEC2_BASE + 0x50UL)
#define OTFDEC2_REGION3_BASE  (OTFDEC2_BASE + 0x80UL)
#define OTFDEC2_REGION4_BASE  (OTFDEC2_BASE + 0xB0UL)
#endif /* CRYP_HASH */
#endif /* H7_LITTLE_SHARK */

/*!< D2_AHB1PERIPH peripherals */

#define DMA1_BASE               (D2_AHB1PERIPH_BASE + 0x0000UL)
#define DMA2_BASE               (D2_AHB1PERIPH_BASE + 0x0400UL)
#define DMAMUX1_BASE            (D2_AHB1PERIPH_BASE + 0x0800UL)
#define ADC1_BASE               (D2_AHB1PERIPH_BASE + 0x2000UL)
#define ADC2_BASE               (D2_AHB1PERIPH_BASE + 0x2100UL)
#define ADC12_COMMON_BASE       (D2_AHB1PERIPH_BASE + 0x2300UL)
#if $DUAL_CORE$
#define ART_BASE                (D2_AHB1PERIPH_BASE + 0x4400UL)
#endif /* DUAL_CORE */
#define ETH_BASE                (D2_AHB1PERIPH_BASE + 0x8000UL)
#define ETH_MAC_BASE            (ETH_BASE)

/*!< USB registers base address */
#define USB1_OTG_HS_PERIPH_BASE              (0x40040000UL)
#if !$H7_LITTLE_SHARK$
#define USB2_OTG_FS_PERIPH_BASE              (0x40080000UL)
#endif /* !H7_LITTLE_SHARK */
#define USB_OTG_GLOBAL_BASE                  (0x000UL)
#define USB_OTG_DEVICE_BASE                  (0x800UL)
#define USB_OTG_IN_ENDPOINT_BASE             (0x900UL)
#define USB_OTG_OUT_ENDPOINT_BASE            (0xB00UL)
#define USB_OTG_EP_REG_SIZE                  (0x20UL)
#define USB_OTG_HOST_BASE                    (0x400UL)
#define USB_OTG_HOST_PORT_BASE               (0x440UL)
#define USB_OTG_HOST_CHANNEL_BASE            (0x500UL)
#define USB_OTG_HOST_CHANNEL_SIZE            (0x20UL)
#define USB_OTG_PCGCCTL_BASE                 (0xE00UL)
#define USB_OTG_FIFO_BASE                    (0x1000UL)
#define USB_OTG_FIFO_SIZE                    (0x1000UL)

/*!< D2_AHB2PERIPH peripherals */

#define DCMI_BASE              (D2_AHB2PERIPH_BASE + 0x0000UL)
#if $H7_LITTLE_SHARK$
#define PSSI_BASE              (D2_AHB2PERIPH_BASE + 0x0400UL)
#endif /* H7_LITTLE_SHARK */
#if $CRYP_HASH$
#define CRYP_BASE              (D2_AHB2PERIPH_BASE + 0x1000UL)
#define HASH_BASE              (D2_AHB2PERIPH_BASE + 0x1400UL)
#define HASH_DIGEST_BASE       (D2_AHB2PERIPH_BASE + 0x1710UL)
#endif /* CRYP_HASH */
#define RNG_BASE               (D2_AHB2PERIPH_BASE + 0x1800UL)
#define SDMMC2_BASE            (D2_AHB2PERIPH_BASE + 0x2400UL)
#define DLYB_SDMMC2_BASE       (D2_AHB2PERIPH_BASE + 0x2800UL)
#define RAMECC2_BASE           (D2_AHB2PERIPH_BASE + 0x3000UL)
#if $H7_LITTLE_SHARK$
#define FMAC_BASE              (D2_AHB2PERIPH_BASE + 0x4000UL)
#define CORDIC_BASE            (D2_AHB2PERIPH_BASE + 0x4400UL)
#endif /* H7_LITTLE_SHARK */

/*!< D3_AHB1PERIPH peripherals */
#define GPIOA_BASE            (D3_AHB1PERIPH_BASE + 0x0000UL)
#define GPIOB_BASE            (D3_AHB1PERIPH_BASE + 0x0400UL)
#define GPIOC_BASE            (D3_AHB1PERIPH_BASE + 0x0800UL)
#define GPIOD_BASE            (D3_AHB1PERIPH_BASE + 0x0C00UL)
#define GPIOE_BASE            (D3_AHB1PERIPH_BASE + 0x1000UL)
#define GPIOF_BASE            (D3_AHB1PERIPH_BASE + 0x1400UL)
#define GPIOG_BASE            (D3_AHB1PERIPH_BASE + 0x1800UL)
#define GPIOH_BASE            (D3_AHB1PERIPH_BASE + 0x1C00UL)
#if !$H7_LITTLE_SHARK$
#define GPIOI_BASE            (D3_AHB1PERIPH_BASE + 0x2000UL)
#endif /* !H7_LITTLE_SHARK */
#define GPIOJ_BASE            (D3_AHB1PERIPH_BASE + 0x2400UL)
#define GPIOK_BASE            (D3_AHB1PERIPH_BASE + 0x2800UL)
#define RCC_BASE              (D3_AHB1PERIPH_BASE + 0x4400UL)
#if $DUAL_CORE$
#define RCC_C1_BASE           (RCC_BASE + 0x130UL)
#define RCC_C2_BASE           (RCC_BASE + 0x190UL)
#endif /*DUAL_CORE*/
#define PWR_BASE              (D3_AHB1PERIPH_BASE + 0x4800UL)
#define CRC_BASE              (D3_AHB1PERIPH_BASE + 0x4C00UL)
#define BDMA_BASE             (D3_AHB1PERIPH_BASE + 0x5400UL)
#define DMAMUX2_BASE          (D3_AHB1PERIPH_BASE + 0x5800UL)
#define ADC3_BASE             (D3_AHB1PERIPH_BASE + 0x6000UL)
#define ADC3_COMMON_BASE      (D3_AHB1PERIPH_BASE + 0x6300UL)
#define HSEM_BASE             (D3_AHB1PERIPH_BASE + 0x6400UL)
#define RAMECC3_BASE          (D3_AHB1PERIPH_BASE + 0x7000UL)

/*!< D1_APB1PERIPH peripherals */
#if $H7_LTDC$
#define LTDC_BASE             (D1_APB1PERIPH_BASE + 0x1000UL)
#define LTDC_Layer1_BASE      (LTDC_BASE + 0x84UL)
#define LTDC_Layer2_BASE      (LTDC_BASE + 0x104UL)
#endif /*H7_LTDC*/
#if $DSI$
#define DSI_BASE              (D1_APB1PERIPH_BASE)
#endif /* DSI */
#define WWDG1_BASE            (D1_APB1PERIPH_BASE + 0x3000UL)

/*!< D2_APB1PERIPH peripherals */
#define TIM2_BASE             (D2_APB1PERIPH_BASE + 0x0000UL)
#define TIM3_BASE             (D2_APB1PERIPH_BASE + 0x0400UL)
#define TIM4_BASE             (D2_APB1PERIPH_BASE + 0x0800UL)
#define TIM5_BASE             (D2_APB1PERIPH_BASE + 0x0C00UL)
#define TIM6_BASE             (D2_APB1PERIPH_BASE + 0x1000UL)
#define TIM7_BASE             (D2_APB1PERIPH_BASE + 0x1400UL)
#define TIM12_BASE            (D2_APB1PERIPH_BASE + 0x1800UL)
#define TIM13_BASE            (D2_APB1PERIPH_BASE + 0x1C00UL)
#define TIM14_BASE            (D2_APB1PERIPH_BASE + 0x2000UL)
#define LPTIM1_BASE           (D2_APB1PERIPH_BASE + 0x2400UL)

#if $DUAL_CORE$
#define WWDG2_BASE            (D2_APB1PERIPH_BASE + 0x2C00UL)
#endif /*DUAL_CORE*/

#define SPI2_BASE             (D2_APB1PERIPH_BASE + 0x3800UL)
#define SPI3_BASE             (D2_APB1PERIPH_BASE + 0x3C00UL)
#define SPDIFRX_BASE          (D2_APB1PERIPH_BASE + 0x4000UL)
#define USART2_BASE           (D2_APB1PERIPH_BASE + 0x4400UL)
#define USART3_BASE           (D2_APB1PERIPH_BASE + 0x4800UL)
#define UART4_BASE            (D2_APB1PERIPH_BASE + 0x4C00UL)
#define UART5_BASE            (D2_APB1PERIPH_BASE + 0x5000UL)
#define I2C1_BASE             (D2_APB1PERIPH_BASE + 0x5400UL)
#define I2C2_BASE             (D2_APB1PERIPH_BASE + 0x5800UL)
#define I2C3_BASE             (D2_APB1PERIPH_BASE + 0x5C00UL)
#if $H7_LITTLE_SHARK$
#define I2C5_BASE             (D2_APB1PERIPH_BASE + 0x6400UL)
#endif /* H7_LITTLE_SHARK */
#define CEC_BASE              (D2_APB1PERIPH_BASE + 0x6C00UL)
#define DAC1_BASE             (D2_APB1PERIPH_BASE + 0x7400UL)
#define UART7_BASE            (D2_APB1PERIPH_BASE + 0x7800UL)
#define UART8_BASE            (D2_APB1PERIPH_BASE + 0x7C00UL)
#define CRS_BASE              (D2_APB1PERIPH_BASE + 0x8400UL)
#define SWPMI1_BASE           (D2_APB1PERIPH_BASE + 0x8800UL)
#define OPAMP_BASE            (D2_APB1PERIPH_BASE + 0x9000UL)
#define OPAMP1_BASE           (D2_APB1PERIPH_BASE + 0x9000UL)
#define OPAMP2_BASE           (D2_APB1PERIPH_BASE + 0x9010UL)
#define MDIOS_BASE            (D2_APB1PERIPH_BASE + 0x9400UL)
#define FDCAN1_BASE           (D2_APB1PERIPH_BASE + 0xA000UL)
#define FDCAN2_BASE           (D2_APB1PERIPH_BASE + 0xA400UL)
#define FDCAN_CCU_BASE        (D2_APB1PERIPH_BASE + 0xA800UL)
#define SRAMCAN_BASE          (D2_APB1PERIPH_BASE + 0xAC00UL)
#if $H7_LITTLE_SHARK$
#define FDCAN3_BASE           (D2_APB1PERIPH_BASE + 0xD400UL)
#define TIM23_BASE            (D2_APB1PERIPH_BASE + 0xE000UL)
#define TIM24_BASE            (D2_APB1PERIPH_BASE + 0xE400UL)
#endif /* H7_LITTLE_SHARK */

