iNavFlight/inav/lib/main/STM32H7/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xxxxx.h
#endif /*TINY_SHARK || LITTLE_SHARK*/
#if  $H7_LITTLE_SHARK$
#define EXTI_EMR3_EM89_Pos         (25U)
#define EXTI_EMR3_EM89_Msk         (0x1UL << EXTI_EMR3_EM89_Pos)               /*!< 0x0200000 */
#define EXTI_EMR3_EM89             EXTI_EMR3_EM89_Msk                          /*!< Interrupt Mask on line 89 */
#define EXTI_EMR3_EM90_Pos         (26U)
#define EXTI_EMR3_EM90_Msk         (0x1UL << EXTI_EMR3_EM90_Pos)               /*!< 0x0400000 */
#define EXTI_EMR3_EM90             EXTI_EMR3_EM90_Msk                          /*!< Interrupt Mask on line 90 */
#define EXTI_EMR3_EM91_Pos         (27U)
#define EXTI_EMR3_EM91_Msk         (0x1UL << EXTI_EMR3_EM91_Pos)               /*!< 0x0800000 */
#define EXTI_EMR3_EM91             EXTI_EMR3_EM91_Msk                          /*!< Interrupt Mask on line 91 */

#endif /*LITTLE_SHARK*/
/*******************  Bit definition for EXTI_PR3 register  ********************/
#if !$H7_TINY_SHARK$ && !$H7_LITTLE_SHARK$
#define EXTI_PR3_PR_Pos            (18U)
#define EXTI_PR3_PR_Msk            (0x1DUL << EXTI_PR3_PR_Pos)                 /*!< 0x00740000 */
#define EXTI_PR3_PR                EXTI_PR3_PR_Msk                             /*!< Pending bit */
#elif $H7_TINY_SHARK$
#define EXTI_PR3_PR_Pos            (18U)
#define EXTI_PR3_PR_Msk            (0x9UL << EXTI_PR3_PR_Pos)                  /*!< 0x00240000 */
#define EXTI_PR3_PR                EXTI_PR3_PR_Msk                             /*!< Pending bit             */
#else
#define EXTI_PR3_PR_Pos            (20U)
#define EXTI_PR3_PR_Msk            (0x7UL << EXTI_PR3_PR_Pos)                  /*!< 0x00700000 */
#define EXTI_PR3_PR                EXTI_PR3_PR_Msk                             /*!< Pending bit             */
#endif /*!TINY_SHARK && !LITTLE_SHARK*/
#if !$H7_LITTLE_SHARK$
#define EXTI_PR3_PR82_Pos          (18U)
#define EXTI_PR3_PR82_Msk          (0x1UL << EXTI_PR3_PR82_Pos)                /*!< 0x00040000 */
#define EXTI_PR3_PR82              EXTI_PR3_PR82_Msk                           /*!< Pending bit for line 82 */
#endif /*!LITTLE_SHARK*/
#if !$H7_TINY_SHARK$
#define EXTI_PR3_PR84_Pos          (20U)
#define EXTI_PR3_PR84_Msk          (0x1UL << EXTI_PR3_PR84_Pos)                /*!< 0x00100000 */
#define EXTI_PR3_PR84              EXTI_PR3_PR84_Msk                           /*!< Pending bit for line 84 */
#endif /*!TINY_SHARK*/
#define EXTI_PR3_PR85_Pos          (21U)
#define EXTI_PR3_PR85_Msk          (0x1UL << EXTI_PR3_PR85_Pos)                /*!< 0x00200000 */
#define EXTI_PR3_PR85              EXTI_PR3_PR85_Msk                           /*!< Pending bit for line 85 */
#if !$H7_TINY_SHARK$
#define EXTI_PR3_PR86_Pos          (22U)
#define EXTI_PR3_PR86_Msk          (0x1UL << EXTI_PR3_PR86_Pos)                /*!< 0x00400000 */
#define EXTI_PR3_PR86              EXTI_PR3_PR86_Msk                           /*!< Pending bit for line 86 */
#endif /*!TINY_SHARK*/
/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
/*
* @brief FLASH Global Defines
*/
#if $H7_VALUE_LINE$
#define FLASH_SIZE_DATA_REGISTER             0x1FF1E880U
#define FLASH_SECTOR_TOTAL                   1U                    /* 1 sector */
#define FLASH_SECTOR_SIZE                    0x00020000UL          /* 128 KB */
#define FLASH_SIZE                           ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0xFFFFU)) ? 0x20000U : \
                                             ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0x0000U)) ? 0x20000U : \
                                             (((uint32_t)(*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) & (0x0FFFU)) << 10U)))  /* 128 KB */
#define FLASH_BANK_SIZE                      FLASH_SIZE            /* 128 KB */
#define FLASH_LATENCY_DEFAULT                FLASH_ACR_LATENCY_7WS /* FLASH Seven Latency cycles */
#define FLASH_NB_32BITWORD_IN_FLASHWORD      8U                    /* 256 bits */

#elif $H7_TINY_VALUE_LINE$
#define FLASH_SIZE_DATA_REGISTER             0x08FFF80CU
#define FLASH_SECTOR_TOTAL                   16U                   /* 16 sectors */
#define FLASH_SECTOR_SIZE                    0x00002000UL          /* 8 KB       */
#define FLASH_SIZE                           ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0xFFFFU)) ? 0x20000U : \
                                             ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0x0000U)) ? 0x20000U : \
                                             (((uint32_t)(*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) & (0x0FFFU)) << 10U)))  /* 128 KB     */
#define FLASH_BANK_SIZE                      FLASH_SIZE            /* 128 KB     */
#define FLASH_LATENCY_DEFAULT                FLASH_ACR_LATENCY_3WS /* FLASH Three Latency cycles */
#define FLASH_NB_32BITWORD_IN_FLASHWORD      4U                    /* 128 bits */
#elif $H7_TINY_SHARK$
#define FLASH_SIZE_DATA_REGISTER             0x08FFF80CU
#define FLASH_SECTOR_TOTAL                   128U                  /* 128 sectors */
#define FLASH_SIZE                           ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0xFFFFU)) ? 0x200000U : \
                                             ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0x0000U)) ? 0x200000U : \
                                             (((uint32_t)(*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) & (0x0FFFU)) << 10U)))  /* 2 MB   */
#define FLASH_BANK_SIZE                      (FLASH_SIZE >> 1)     /* 1 MB   */
#define FLASH_SECTOR_SIZE                    0x00002000UL          /* 8 KB   */
#define FLASH_LATENCY_DEFAULT                FLASH_ACR_LATENCY_3WS /* FLASH Three Latency cycles */
#define FLASH_NB_32BITWORD_IN_FLASHWORD      4U                    /* 128 bits */
#define DUAL_BANK                                                  /* Dual-bank Flash */
#elif $H7_LITTLE_VALUE_LINE$
#define FLASH_SIZE_DATA_REGISTER             0x1FF1E880U
#define FLASH_SECTOR_TOTAL                   1U                    /* 1 sector */
#define FLASH_SECTOR_SIZE                    0x00020000UL          /* 128 KB */
#define FLASH_SIZE                           ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0xFFFFU)) ? 0x20000U : \
                                             ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0x0000U)) ? 0x20000U : \
                                             (((uint32_t)(*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) & (0x0FFFU)) << 10U)))  /* 128 KB   */
#define FLASH_BANK_SIZE                      FLASH_SIZE            /* 128 KB */
#define FLASH_LATENCY_DEFAULT                FLASH_ACR_LATENCY_7WS /* FLASH Seven Latency cycles */
#define FLASH_NB_32BITWORD_IN_FLASHWORD      8U                    /* 256 bits */
#elif $H7_LITTLE_SHARK$
#define FLASH_SIZE_DATA_REGISTER             0x1FF1E880U
#define FLASH_SECTOR_TOTAL                   8U                    /* 8 sectors */
#define FLASH_SIZE                           ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0xFFFFU)) ? 0x100000U : \
                                             ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0x0000U)) ? 0x100000U : \
                                             (((uint32_t)(*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) & (0x0FFFU)) << 10U)))  /* 1 MB   */
#define FLASH_BANK_SIZE                      FLASH_SIZE            /* 1 MB   */
#define FLASH_SECTOR_SIZE                    0x00020000UL          /* 128 KB   */
#define FLASH_LATENCY_DEFAULT                FLASH_ACR_LATENCY_7WS /* FLASH Seven Latency cycles */
#define FLASH_NB_32BITWORD_IN_FLASHWORD      8U                    /* 256 bits */
#elif $DUAL_CORE$
#if defined(CORE_CM4)
#if $H7_DUAL_CORE_1M$
#define FLASH_SIZE                           0x100000UL            /* 1 MB   */
#else
#define FLASH_SIZE                           0x200000UL            /* 2 MB   */
#endif /* H7_DUAL_CORE_1M */
#else
#define FLASH_SIZE_DATA_REGISTER             0x1FF1E880U
#define FLASH_SIZE                           ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0xFFFFU)) ? 0x200000U : \
                                             ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0x0000U)) ? 0x200000U : \
                                             (((uint32_t)(*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) & (0x0FFFU)) << 10U)))  /* 2 MB   */
#endif /* CORE_CM4 */
#define FLASH_SECTOR_TOTAL                   8U                    /* 8 sectors */
#define FLASH_BANK_SIZE                      (FLASH_SIZE >> 1)     /* 1 MB   */
#define FLASH_SECTOR_SIZE                    0x00020000UL          /* 128 KB */
#define FLASH_LATENCY_DEFAULT                FLASH_ACR_LATENCY_7WS /* FLASH Seven Latency cycles */
#define FLASH_NB_32BITWORD_IN_FLASHWORD      8U                    /* 256 bits */
#define DUAL_BANK                                                  /* Dual-bank Flash */
#else
#define FLASH_SIZE_DATA_REGISTER             0x1FF1E880U
#define FLASH_SECTOR_TOTAL                   8U                    /* 8 sectors */
#define FLASH_SIZE                           ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0xFFFFU)) ? 0x200000U : \
                                             ((((*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) == 0x0000U)) ? 0x200000U : \
                                             (((uint32_t)(*((uint16_t *)FLASH_SIZE_DATA_REGISTER)) & (0x0FFFU)) << 10U)))  /* 2 MB   */
#define FLASH_BANK_SIZE                      (FLASH_SIZE >> 1)     /* 1 MB   */
#define FLASH_SECTOR_SIZE                    0x00020000UL          /* 128 KB */
#define FLASH_LATENCY_DEFAULT                FLASH_ACR_LATENCY_7WS /* FLASH Seven Latency cycles */
#define FLASH_NB_32BITWORD_IN_FLASHWORD      8U                    /* 256 bits */
#define DUAL_BANK                                                  /* Dual-bank Flash */
#endif /* H7_VALUE_LINE */

