iNavFlight/inav/lib/main/STM32H7/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xxxxx.h
/********************  Bit definition for RCC_RSR register  *******************/
#define RCC_RSR_RMVF_Pos                       (16U)
#define RCC_RSR_RMVF_Msk                       (0x1UL << RCC_RSR_RMVF_Pos)     /*!< 0x00010000 */
#define RCC_RSR_RMVF                           RCC_RSR_RMVF_Msk
#if $DUAL_CORE$
#define RCC_RSR_C1RSTF_Pos                     (17U)
#define RCC_RSR_C1RSTF_Msk                     (0x1UL << RCC_RSR_C1RSTF_Pos)   /*!< 0x00020000 */
#define RCC_RSR_C1RSTF                         RCC_RSR_C1RSTF_Msk
#else
#if !$H7_TINY_SHARK$
#define RCC_RSR_CPURSTF_Pos                    (17U)
#define RCC_RSR_CPURSTF_Msk                    (0x1UL << RCC_RSR_CPURSTF_Pos)  /*!< 0x00020000 */
#define RCC_RSR_CPURSTF                        RCC_RSR_CPURSTF_Msk
#endif /*Tiny Shark*/
#endif /*DUAL_CORE*/
#if !$H7_TINY_SHARK$
#define RCC_RSR_D1RSTF_Pos                     (19U)
#define RCC_RSR_D1RSTF_Msk                     (0x1UL << RCC_RSR_D1RSTF_Pos)   /*!< 0x00080000 */
#define RCC_RSR_D1RSTF                         RCC_RSR_D1RSTF_Msk
#define RCC_RSR_D2RSTF_Pos                     (20U)
#define RCC_RSR_D2RSTF_Msk                     (0x1UL << RCC_RSR_D2RSTF_Pos)   /*!< 0x00100000 */
#define RCC_RSR_D2RSTF                         RCC_RSR_D2RSTF_Msk
#else
#define RCC_RSR_CDRSTF_Pos                     (19U)
#define RCC_RSR_CDRSTF_Msk                     (0x1UL << RCC_RSR_CDRSTF_Pos)   /*!< 0x00080000 */
#define RCC_RSR_CDRSTF                         RCC_RSR_CDRSTF_Msk
#endif
#define RCC_RSR_BORRSTF_Pos                    (21U)
#define RCC_RSR_BORRSTF_Msk                    (0x1UL << RCC_RSR_BORRSTF_Pos)  /*!< 0x00200000 */
#define RCC_RSR_BORRSTF                        RCC_RSR_BORRSTF_Msk
#define RCC_RSR_PINRSTF_Pos                    (22U)
#define RCC_RSR_PINRSTF_Msk                    (0x1UL << RCC_RSR_PINRSTF_Pos)  /*!< 0x00400000 */
#define RCC_RSR_PINRSTF                        RCC_RSR_PINRSTF_Msk
#define RCC_RSR_PORRSTF_Pos                    (23U)
#define RCC_RSR_PORRSTF_Msk                    (0x1UL << RCC_RSR_PORRSTF_Pos)  /*!< 0x00800000 */
#define RCC_RSR_PORRSTF                        RCC_RSR_PORRSTF_Msk
#if $DUAL_CORE$
#define RCC_RSR_SFT1RSTF_Pos                   (24U)
#define RCC_RSR_SFT1RSTF_Msk                   (0x1UL << RCC_RSR_SFT1RSTF_Pos) /*!< 0x01000000 */
#define RCC_RSR_SFT1RSTF                       RCC_RSR_SFT1RSTF_Msk
#else
#define RCC_RSR_SFTRSTF_Pos                    (24U)
#define RCC_RSR_SFTRSTF_Msk                    (0x1UL << RCC_RSR_SFTRSTF_Pos)  /*!< 0x01000000 */
#define RCC_RSR_SFTRSTF                        RCC_RSR_SFTRSTF_Msk
#endif /*DUAL_CORE*/
#if !$H7_TINY_SHARK$
#define RCC_RSR_IWDG1RSTF_Pos                  (26U)
#define RCC_RSR_IWDG1RSTF_Msk                  (0x1UL << RCC_RSR_IWDG1RSTF_Pos) /*!< 0x04000000 */
#define RCC_RSR_IWDG1RSTF                      RCC_RSR_IWDG1RSTF_Msk
#define RCC_RSR_WWDG1RSTF_Pos                  (28U)
#define RCC_RSR_WWDG1RSTF_Msk                  (0x1UL << RCC_RSR_WWDG1RSTF_Pos) /*!< 0x10000000 */
#define RCC_RSR_WWDG1RSTF                      RCC_RSR_WWDG1RSTF_Msk
#else
#define RCC_RSR_IWDGRSTF_Pos                   (26U)
#define RCC_RSR_IWDGRSTF_Msk                   (0x1UL << RCC_RSR_IWDGRSTF_Pos) /*!< 0x04000000 */
#define RCC_RSR_IWDGRSTF                       RCC_RSR_IWDGRSTF_Msk
#define RCC_RSR_WWDGRSTF_Pos                   (28U)
#define RCC_RSR_WWDGRSTF_Msk                   (0x1UL << RCC_RSR_WWDGRSTF_Pos) /*!< 0x10000000 */
#define RCC_RSR_WWDGRSTF                       RCC_RSR_WWDGRSTF_Msk
#endif

#if $DUAL_CORE$
#define RCC_RSR_WWDG2RSTF_Pos                  (29U)
#define RCC_RSR_WWDG2RSTF_Msk                  (0x1UL << RCC_RSR_WWDG2RSTF_Pos) /*!< 0x20000000 */
#define RCC_RSR_WWDG2RSTF                      RCC_RSR_WWDG2RSTF_Msk
#define RCC_RSR_IWDG2RSTF_Pos                  (27U)
#define RCC_RSR_IWDG2RSTF_Msk                  (0x1UL << RCC_RSR_IWDG2RSTF_Pos) /*!< 0x08000000 */
#define RCC_RSR_IWDG2RSTF                      RCC_RSR_IWDG2RSTF_Msk
#define RCC_RSR_SFT2RSTF_Pos                   (25U)
#define RCC_RSR_SFT2RSTF_Msk                   (0x1UL << RCC_RSR_SFT2RSTF_Pos) /*!< 0x02000000 */
#define RCC_RSR_SFT2RSTF                       RCC_RSR_SFT2RSTF_Msk
#define RCC_RSR_C2RSTF_Pos                     (18U)
#define RCC_RSR_C2RSTF_Msk                     (0x1UL << RCC_RSR_C2RSTF_Pos)   /*!< 0x00040000 */
#define RCC_RSR_C2RSTF                         RCC_RSR_C2RSTF_Msk
#define RCC_RSR_LPWR1RSTF_Pos                  (30U)
#define RCC_RSR_LPWR1RSTF_Msk                  (0x1UL << RCC_RSR_LPWR1RSTF_Pos) /*!< 0x40000000 */
#define RCC_RSR_LPWR1RSTF                      RCC_RSR_LPWR1RSTF_Msk
#define RCC_RSR_LPWR2RSTF_Pos                  (31U)
#define RCC_RSR_LPWR2RSTF_Msk                  (0x1UL << RCC_RSR_LPWR2RSTF_Pos) /*!< 0x80000000 */
#define RCC_RSR_LPWR2RSTF                      RCC_RSR_LPWR2RSTF_Msk
#else
#define RCC_RSR_LPWRRSTF_Pos                   (30U)
#define RCC_RSR_LPWRRSTF_Msk                   (0x1UL << RCC_RSR_LPWRRSTF_Pos) /*!< 0x40000000 */
#define RCC_RSR_LPWRRSTF                       RCC_RSR_LPWRRSTF_Msk
#endif /*DUAL_CORE*/


#if $H7_TINY_SHARK$
/* Legacy define */
#define RCC_RSR_IWDG1RSTF_Pos                  RCC_RSR_IWDGRSTF_Pos
#define RCC_RSR_IWDG1RSTF_Msk                  RCC_RSR_IWDGRSTF_Msk
#define RCC_RSR_IWDG1RSTF                      RCC_RSR_IWDGRSTF
#define RCC_RSR_WWDG1RSTF_Pos                  RCC_RSR_WWDGRSTF_Pos
#define RCC_RSR_WWDG1RSTF_Msk                  RCC_RSR_WWDGRSTF_Msk
#define RCC_RSR_WWDG1RSTF                      RCC_RSR_WWDGRSTF
#endif /* H7_TINY_SHARK */
/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
#if $H7_TINY_SHARK$
/***************************    RNG VER  **************************************/
#define RNG_VER_3_1
#endif /* H7_TINY_SHARK */
#if $H7_LITTLE_SHARK$
/***************************    RNG VER  **************************************/
#define RNG_VER_3_2
#endif /* H7_LITTLE_SHARK */
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN_Pos    (2U)
#define RNG_CR_RNGEN_Msk    (0x1UL << RNG_CR_RNGEN_Pos)                        /*!< 0x00000004 */
#define RNG_CR_RNGEN        RNG_CR_RNGEN_Msk
#define RNG_CR_IE_Pos       (3U)
#define RNG_CR_IE_Msk       (0x1UL << RNG_CR_IE_Pos)                           /*!< 0x00000008 */
#define RNG_CR_IE           RNG_CR_IE_Msk
#define RNG_CR_CED_Pos      (5U)
#define RNG_CR_CED_Msk      (0x1UL << RNG_CR_CED_Pos)                          /*!< 0x00000020 */
#define RNG_CR_CED          RNG_CR_CED_Msk
#if $H7_TINY_SHARK$ || $H7_LITTLE_SHARK$
#define RNG_CR_RNG_CONFIG3_Pos      (8U)
#define RNG_CR_RNG_CONFIG3_Msk      (0xFUL << RNG_CR_RNG_CONFIG3_Pos)          /*!< 0x00000F00 */
#define RNG_CR_RNG_CONFIG3          RNG_CR_RNG_CONFIG3_Msk
#define RNG_CR_NISTC_Pos            (12U)
#define RNG_CR_NISTC_Msk            (0x1UL << RNG_CR_NISTC_Pos)                /*!< 0x00001000 */
#define RNG_CR_NISTC                RNG_CR_NISTC_Msk
#define RNG_CR_RNG_CONFIG2_Pos      (13U)
#define RNG_CR_RNG_CONFIG2_Msk      (0x7UL << RNG_CR_RNG_CONFIG2_Pos)          /*!< 0x0000E000 */
#define RNG_CR_RNG_CONFIG2          RNG_CR_RNG_CONFIG2_Msk
#define RNG_CR_CLKDIV_Pos           (16U)
#define RNG_CR_CLKDIV_Msk           (0xFUL << RNG_CR_CLKDIV_Pos)               /*!< 0x000F0000 */
#define RNG_CR_CLKDIV               RNG_CR_CLKDIV_Msk
#define RNG_CR_CLKDIV_0             (0x1U << RNG_CR_CLKDIV_Pos)                /*!< 0x00010000 */
#define RNG_CR_CLKDIV_1             (0x2U << RNG_CR_CLKDIV_Pos)                /*!< 0x00020000 */
#define RNG_CR_CLKDIV_2             (0x4U << RNG_CR_CLKDIV_Pos)                /*!< 0x00040000 */
#define RNG_CR_CLKDIV_3             (0x8U << RNG_CR_CLKDIV_Pos)                /*!< 0x00080000 */
#define RNG_CR_RNG_CONFIG1_Pos      (20U)
#define RNG_CR_RNG_CONFIG1_Msk      (0x3FUL << RNG_CR_RNG_CONFIG1_Pos)         /*!< 0x03F00000 */
#define RNG_CR_RNG_CONFIG1          RNG_CR_RNG_CONFIG1_Msk
#define RNG_CR_CONDRST_Pos         (30U)
#define RNG_CR_CONDRST_Msk         (0x1UL << RNG_CR_CONDRST_Pos)                  /*!< 0x40000000 */
#define RNG_CR_CONDRST             RNG_CR_CONDRST_Msk
#define RNG_CR_CONFIGLOCK_Pos      (31U)
#define RNG_CR_CONFIGLOCK_Msk      (0x1UL << RNG_CR_CONFIGLOCK_Pos)            /*!< 0x80000000 */
#define RNG_CR_CONFIGLOCK          RNG_CR_CONFIGLOCK_Msk
#endif /* !H7_TINY_SHARK H7_LITTLE_SHARK*/

