iNavFlight/inav/lib/main/STM32H7/Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xxxxx.h
/****************************** IWDG Instances ********************************/
#if $DUAL_CORE$
#define IS_IWDG_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == IWDG1) || ((INSTANCE) == IWDG2))
#else  /* SINGLE_CORE */
#define IS_IWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == IWDG1)
#endif /*DUAL_CORE*/
/****************************** USB Instances ********************************/
#define IS_USB_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB)

/****************************** WWDG Instances ********************************/
#if $DUAL_CORE$
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == WWDG1) || \
                                         ((INSTANCE) == WWDG2))
#else  /* SINGLE_CORE */
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG1)
#endif /*DUAL_CORE*/
/****************************** MDIOS Instances ********************************/
#define IS_MDIOS_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == MDIOS)

/****************************** CEC Instances *********************************/
#define IS_CEC_ALL_INSTANCE(__INSTANCE__) ((__INSTANCE__) == CEC)

/****************************** SAI Instances ********************************/
#if $H7_TINY_SHARK$
#define IS_SAI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SAI1_Block_A) || \
                                       ((INSTANCE) == SAI1_Block_B) || \
                                       ((INSTANCE) == SAI2_Block_A) || \
                                       ((INSTANCE) == SAI2_Block_B))
#elif $H7_LITTLE_SHARK$
#define IS_SAI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SAI1_Block_A) || \
                                       ((INSTANCE) == SAI1_Block_B) || \
                                       ((INSTANCE) == SAI4_Block_A) || \
                                       ((INSTANCE) == SAI4_Block_B))
#else /* H7_SHARK */
#define IS_SAI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SAI1_Block_A) || \
                    ((INSTANCE) == SAI1_Block_B) || \
                     ((INSTANCE) == SAI2_Block_A) || \
                     ((INSTANCE) == SAI2_Block_B) || \
                     ((INSTANCE) == SAI3_Block_A) || \
                     ((INSTANCE) == SAI3_Block_B) || \
                     ((INSTANCE) == SAI4_Block_A) || \
                     ((INSTANCE) == SAI4_Block_B))
#endif /* H7_TINY_SHARK */

/****************************** SPDIFRX Instances ********************************/
#define IS_SPDIFRX_ALL_INSTANCE(INSTANCE) ((INSTANCE) == SPDIFRX)

/****************************** OPAMP Instances *******************************/
#define IS_OPAMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == OPAMP1) || \
                                         ((INSTANCE) == OPAMP2))

#define IS_OPAMP_COMMON_INSTANCE(COMMON_INSTANCE) ((COMMON_INSTANCE) == OPAMP12_COMMON)

#if $H7_TINY_SHARK$ || $H7_LITTLE_SHARK$
/*********************** USB OTG PCD Instances ********************************/
#define IS_PCD_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB_OTG_HS)

/*********************** USB OTG HCD Instances ********************************/
#define IS_HCD_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB_OTG_HS)
#else
/*********************** USB OTG PCD Instances ********************************/
#define IS_PCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB_OTG_FS) || \
                                        ((INSTANCE) == USB_OTG_HS))

/*********************** USB OTG HCD Instances ********************************/
#define IS_HCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB_OTG_FS) || \
                                       ((INSTANCE) == USB_OTG_HS))
#endif

/******************************************************************************/
/*  For a painless codes migration between the STM32H7xx device product       */
/*  lines, or with STM32F7xx devices the aliases defined below are put        */
/*   in place to overcome the differences in the interrupt handlers and IRQn  */
/*   definitions. No need to update developed interrupt code when moving      */
/*  across product lines within the same STM32H7 Family                       */
/******************************************************************************/

/* Aliases for __IRQn */
#if $CRYP_HASH$
#define  RNG_IRQn                       HASH_RNG_IRQn
#else
#define  HASH_RNG_IRQn                  RNG_IRQn
#endif
#define  TIM1_BRK_TIM9_IRQn             TIM1_BRK_IRQn
#define  TIM1_UP_TIM10_IRQn             TIM1_UP_IRQn
#define  TIM1_TRG_COM_TIM11_IRQn        TIM1_TRG_COM_IRQn
#define  PVD_IRQn                       PVD_AVD_IRQn

#if $H7_TINY_SHARK$
/* Aliases for BDMA __IRQn */
#define  BDMA_Channel0_IRQn             BDMA2_Channel0_IRQn
#define  BDMA_Channel1_IRQn             BDMA2_Channel1_IRQn
#define  BDMA_Channel2_IRQn             BDMA2_Channel2_IRQn
#define  BDMA_Channel3_IRQn             BDMA2_Channel3_IRQn
#define  BDMA_Channel4_IRQn             BDMA2_Channel4_IRQn
#define  BDMA_Channel5_IRQn             BDMA2_Channel5_IRQn
#define  BDMA_Channel6_IRQn             BDMA2_Channel6_IRQn
#define  BDMA_Channel7_IRQn             BDMA2_Channel7_IRQn

/* Aliases for PWR __IRQn */
#define  PVD_AVD_IRQn                   PVD_PVM_IRQn
#endif /*H7_TINY_SHARK*/

#if $H7_TINY_SHARK$ || $H7_LITTLE_SHARK$
/* Aliases for DCMI/PSSI __IRQn */
#define  DCMI_IRQn                      DCMI_PSSI_IRQn
#endif /*H7_TINY_SHARK*/

/* Aliases for __IRQHandler */
#if $CRYP_HASH$
#define   RNG_IRQHandler               HASH_RNG_IRQHandler
#else
#define  HASH_RNG_IRQHandler           RNG_IRQHandler
#endif
#define TIM1_BRK_TIM9_IRQHandler       TIM1_BRK_IRQHandler
#define TIM1_UP_TIM9_IRQHandler        TIM1_UP_IRQHandler
#define TIM1_TRG_COM_TIM11_IRQHandler  TIM1_TRG_COM_IRQHandler
#define PVD_IRQHandler                 PVD_AVD_IRQHandler

#if !$H7_TINY_SHARK$
/* Aliases for COMP __IRQHandler */
#define COMP_IRQHandler                COMP1_IRQHandler
#endif

#if $H7_TINY_SHARK$
/* Aliases for BDMA __IRQHandler */
#define  BDMA_Channel0_IRQHandler      BDMA2_Channel0_IRQHandler
#define  BDMA_Channel1_IRQHandler      BDMA2_Channel1_IRQHandler
#define  BDMA_Channel2_IRQHandler      BDMA2_Channel2_IRQHandler
#define  BDMA_Channel3_IRQHandler      BDMA2_Channel3_IRQHandler
#define  BDMA_Channel4_IRQHandler      BDMA2_Channel4_IRQHandler
#define  BDMA_Channel5_IRQHandler      BDMA2_Channel5_IRQHandler
#define  BDMA_Channel6_IRQHandler      BDMA2_Channel6_IRQHandler
#define  BDMA_Channel7_IRQHandler      BDMA2_Channel7_IRQHandler

/* Aliases for PWR __IRQHandler */
#define  PVD_AVD_IRQHandler            PVD_PVM_IRQHandler

/* Aliases for DCMI/PSSI __IRQHandler */
#define  DCMI_IRQHandler               DCMI_PSSI_IRQHandler

/* Alias for BDMA defines */
#define BDMA_BASE              BDMA2_BASE
#define BDMA_Channel0_BASE     BDMA2_Channel0_BASE
#define BDMA_Channel1_BASE     BDMA2_Channel1_BASE
#define BDMA_Channel2_BASE     BDMA2_Channel2_BASE
#define BDMA_Channel3_BASE     BDMA2_Channel3_BASE
#define BDMA_Channel4_BASE     BDMA2_Channel4_BASE
#define BDMA_Channel5_BASE     BDMA2_Channel5_BASE
#define BDMA_Channel6_BASE     BDMA2_Channel6_BASE
#define BDMA_Channel7_BASE     BDMA2_Channel7_BASE

#define BDMA                   BDMA2
#define BDMA_Channel0          BDMA2_Channel0
#define BDMA_Channel1          BDMA2_Channel1
#define BDMA_Channel2          BDMA2_Channel2
#define BDMA_Channel3          BDMA2_Channel3
#define BDMA_Channel4          BDMA2_Channel4
#define BDMA_Channel5          BDMA2_Channel5
#define BDMA_Channel6          BDMA2_Channel6
#define BDMA_Channel7          BDMA2_Channel7

/* Alias for PWR defines */
#define PWR_CPUCR_RUN_D3       PWR_CPUCR_RUN_SRD
#define PWR_CPUCR_PDDS_D3      PWR_CPUCR_PDDS_SRD
#define PWR_CPUCR_PDDS_D1      PWR_CPUCR_RETDS_CD

#define PWR_D3CR_VOS           PWR_SRDCR_VOS

#define PWR_D3CR_VOS_0         PWR_SRDCR_VOS_0
#define PWR_D3CR_VOS_1         PWR_SRDCR_VOS_1
#define PWR_D3CR_VOSRDY        PWR_SRDCR_VOSRDY

#endif /*TINY_SHARK*/
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* $PRODUCTNAME_UC$_H */

